run/ReiheM_6_v_2.0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"		//Einbinden des "initialConditions"-File um Variablen zugänglich zu machen

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 $Filamentgeschw);		//Definiert in 0/initialConditions
    }

    outlet
    {
        type            zeroGradient;
    }

    wall_top
    {
        type            slip;		//keine Wandhaftung im Zylindrischen Bereich der Düse
    }

    wall_middle
    {
        type            noSlip;		//Wandhaftung im konischen Teil der Düse
    }

    wall_bottom
    {
        type            noSlip;		//Wandhaftung im Auslauf der Düse
    }
    front_top
    {
        type            wedge;
    }

    front_middle
    {
        type            wedge;
    }

    front_bottom
    {
        type            wedge;
    }

    back_top
    {
        type            wedge;
    }

    back_middle
    {
        type            wedge;
    }
    back_bottom
    {
        type            wedge;
    }
    axis_top
    {
        type            symmetryPlane;
    }
    axis_middle
    {
        type            symmetryPlane;
    }
    axis_bottom
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
