run/ReiheM_6_v_2.0/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT				// limitieren der Temperatur in physikalisch sinvollem Bereich um Stabilität und Konvergenz zu erhöhen
{
    type            limitTemperature;

    active	    yes;
    limitTemperatureCoeffs
    {
	selectionMode	all;
	min		290;	// Tmin [K]
	max		600;	// Tmax [K]
    }
}



// ************************************************************************* //
