run/ReiheM_6_v_2.0/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 12;		//Zahl der Kerne auf denen gerechnet werden soll, für IKT-Simulations-PC hat sich ein Optimum von 16 gezeigt

method          simple;		//einfache Zerlegung in gleich große Abschnitte

simpleCoeffs
{
    n               (1 1 $numberOfSubdomains);	//Zerlegung in z-Richtung
    delta           0.001;
}


//____weitere Zerlegungsmöglichkeiten
/*
hierarchicalCoeffs
{
    n               (4 1 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

metisCoeffs
{
    //n                   (5 1 1);
    //cellWeightsFile     "constant/cellWeightsFile";
}
*/
